#+latex_class: article_egos
# erases make title
# #+BIND: org-export-latex-title-command ""

# fucks all the maketitlestuff just to be sure
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: h:5



#+BEGIN_SRC R :session calc :exports none :results values drawer :dir /home/johannes/
library(jtls)
dt_nbrs <- fread("/home/johannes/Dropbox/phd/papers/closing/misc/nbrs.csv")
wd_nbrs(dt_nbrs)
## quit(save="no")
#+end_src

#+RESULTS:
:results:
# descs
#+MACRO: pmdb_n_all 550
#+MACRO: pmdb_n_US 70
#+MACRO: pmdb_n_closed_US 9
#+MACRO: pmdb_open_atm 453
#+MACRO: pm_n_closed 68
#+MACRO: n_pmyears 6096
#+MACRO: pmdb_n_nlpm 25
#+MACRO: pmdb_n_closed 72
#+MACRO: pmdb_n 525
#+MACRO: pmdb_n_closed_NAclosingyear 2
#+MACRO: pmdb_n_closed_before2k 2
#+MACRO: pmdb_n_open_NAopeningyear 1
#+MACRO: pmx_n 505
#+MACRO: n_founder_dead 47
#+MACRO: perc_founder_dead 9.3
#+MACRO: pm_n_used 503
#+MACRO: n_pm_close_after_recent_death 3
#+MACRO: pm_open_from2021 17
#+MACRO: N_slfid_other 140
#+MACRO: N_slfid_museum 190
#+MACRO: N_slfid_foundation 104
#+MACRO: N_slfid_collection 69
#+MACRO: perc_slfid_other 28
#+MACRO: perc_slfid_museum 38
#+MACRO: perc_slfid_foundation 21
#+MACRO: perc_slfid_collection 14
#+MACRO: mow_prop_name_museum 71


# egmus
#+MACRO: own_state_cnt 2264
#+MACRO: own_loc_reg_cnt 7690
#+MACRO: own_publicother_cnt 641
#+MACRO: own_priv_cnt 5052
#+MACRO: own_ttl_cnt 15647
#+MACRO: own_state_perc 14
#+MACRO: own_loc_reg_perc 49
#+MACRO: own_publicother_perc 4.1
#+MACRO: own_priv_perc 32
#+MACRO: own_ttl_perc 100
#+MACRO: perc_entryfees 12
#+MACRO: perc_subsidies 69


# meanhaz
#+MACRO: meanhaz_upto_2 0.10%
#+MACRO: meanhaz_upto_4 0.49%
#+MACRO: meanhaz_upto_5 0.69%
#+MACRO: meanhaz_upto_8 0.73%
#+MACRO: meanhaz_upto_10 0.89%
#+MACRO: meanhaz_upto_20 1.09%
#+MACRO: meanhaz_upto_30 1.16%
#+MACRO: meanhaz_upto_40 0.96%
#+MACRO: meanhaz_upto_100 0.90%
#+MACRO: meanhaz_8onwards 0.92%
#+MACRO: meanhaz_8to30 1.20%
#+MACRO: median_life_expectancy 52


# yearhaz
#+MACRO: yearhaz_all 0.84%
#+MACRO: yearhaz_allw 1.12%
#+MACRO: yearhaz_upto2010 0.21%
#+MACRO: yearhaz_from2010 1.36%


# pltcfgs
#+MACRO: ynkplt_p_vrblcvrg_ugrpd (eval (concat "#+label: fig:p_vrblcvrg_ugrpd\n" "#+caption: PMDB variable coverage by museum status\n" "#+attr_latex: :width 19cm\n" "[[file:../figures/p_vrblcvrg_ugrpd.pdf]]"))
#+MACRO: ynkplt_p_vrblcvrg (eval (concat "#+label: fig:p_vrblcvrg\n" "#+caption: PMDB variable coverage by museum status and variable group\n" "#+attr_latex: :width 19cm\n" "[[file:../figures/p_vrblcvrg.pdf]]"))
#+MACRO: ynkplt_p_vrblcvrg_ratio (eval (concat "#+label: fig:p_vrblcvrg_ratio\n" "#+caption: PMDB variable coverage (abs/rel prop) by museum status and variable group\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_vrblcvrg_ratio.pdf]]"))
#+MACRO: ynkplt_p_vrblcvrg_pca (eval (concat "#+label: fig:p_vrblcvrg_pca\n" "#+caption: coverage of variables used in PCA\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_vrblcvrg_pca.pdf]]"))
#+MACRO: ynkplt_p_scree (eval (concat "#+label: fig:p_scree\n" "#+caption: Scree plot of PCA dimensionality reduction\n" "#+attr_latex: :width 14cm\n" "[[file:../figures/p_scree.pdf]]"))
#+MACRO: ynkplt_p_pca_loadings (eval (concat "#+label: fig:p_pca_loadings\n" "#+caption: loadings of first 2 PCs\n" "#+attr_latex: :width 14cm\n" "[[file:../figures/p_pca_loadings.pdf]]"))
#+MACRO: ynkplt_p_pca_scores (eval (concat "#+label: fig:p_pca_scores\n" "#+caption: scores on first PCs\n" "#+attr_latex: :width 16cm\n" "[[file:../figures/p_pca_scores.pdf]]"))
#+MACRO: ynkplt_p_surv (eval (concat "#+label: fig:p_surv\n" "#+caption: Private Museum Survival probability\n" "#+attr_latex: :width 14cm\n" "[[file:../figures/p_surv.pdf]]"))
#+MACRO: ynkplt_p_hazard (eval (concat "#+label: fig:p_hazard\n" "#+caption: Private Museum hazard function\n" "#+attr_latex: :width 16cm\n" "[[file:../figures/p_hazard.pdf]]"))
#+MACRO: ynkplt_p_hazard_time (eval (concat "#+label: fig:p_hazard_time\n" "#+caption: Private Museum hazard function by year\n" "#+attr_latex: :width 16cm\n" "[[file:../figures/p_hazard_time.pdf]]"))
#+MACRO: ynkplt_p_agedens (eval (concat "#+label: fig:p_agedens\n" "#+caption: Age distribution of private museums\n" "#+attr_latex: :width 17cm\n" "[[file:../figures/p_agedens.pdf]]"))
#+MACRO: ynkplt_p_yeardens (eval (concat "#+label: fig:p_yeardens\n" "#+caption: Private Museum-year Distribution\n" "#+attr_latex: :width 19cm\n" "[[file:../figures/p_yeardens.pdf]]"))
#+MACRO: ynkplt_p_coxphdiag_more (eval (concat "#+label: fig:p_coxphdiag_more\n" "#+caption: Model Diagnostics\n" "#+attr_latex: :width 19cm\n" "[[file:../figures/p_coxphdiag_more.pdf]]"))
#+MACRO: ynkplt_p_pred_popprxcnt (eval (concat "#+label: fig:p_pred_popprxcnt\n" "#+caption: Predicted Avg. Hazard Rate on Regional PM Density and Population\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_pred_popprxcnt.pdf]]"))
#+MACRO: ynkplt_p_pred_proxcntpop (eval (concat "#+label: fig:p_pred_proxcntpop\n" "#+caption: Predicted Avg. Hazard Rate on Regional PM Density and Population\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_pred_proxcntpop.pdf]]"))
#+MACRO: ynkplt_p_condmef (eval (concat "#+label: fig:p_condmef\n" "#+caption: Conditional effects of Regional PM Density and Population\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_condmef.pdf]]"))
#+MACRO: ynkplt_p_pred_heatmap (eval (concat "#+label: fig:p_pred_heatmap\n" "#+caption: Predicted Avg. Hazard Rate on Regional PM Density and Population (at available values)\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_pred_heatmap.pdf]]"))
#+MACRO: ynkplt_p_heatmap_info (eval (concat "#+label: fig:p_heatmap_info\n" "#+caption: heatmap info plots\n" "#+attr_latex: :width 35cm\n" "[[file:../figures/p_heatmap_info.pdf]]"))
#+MACRO: ynkplt_p_pred_heatmap_wocryside (eval (concat "#+label: fig:p_pred_heatmap_wocryside\n" "#+caption: Predicted Avg. Hazard Rate from Regional PM Density and Population (without proxcnt < 2 & popm_circle10 <2)\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_pred_heatmap_wocryside.pdf]]"))
#+MACRO: ynkplt_p_pred_heatmap_onlycryside (eval (concat "#+label: fig:p_pred_heatmap_onlycryside\n" "#+caption: Predicted Avg. Hazard Rate from Regional PM Density and Population (only proxcnt < 2 & popm_circle10 <2)\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_pred_heatmap_onlycryside.pdf]]"))
#+MACRO: ynkplt_p_pred_heatmap_alt (eval (concat "#+label: fig:p_pred_heatmap_alt\n" "#+caption: Prediction Heatmap of Alternative model specifications\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_pred_heatmap_alt.pdf]]"))
#+MACRO: ynkplt_p_surv_death (eval (concat "#+label: fig:p_surv_death\n" "#+caption: Comparison of Survival Estimates by Founder Death (95% CI)\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_surv_death.pdf]]"))
#+MACRO: ynkplt_p_lngtdvelp (eval (concat "#+label: fig:p_lngtdvelp\n" "#+caption: Composition of private museum population\n" "#+attr_latex: :width 18cm\n" "[[file:../figures/p_lngtdvelp.pdf]]"))


# figlbls
#+MACRO: refplt_p_vrblcvrg_ugrpd \ref{fig:p_vrblcvrg_ugrpd}
#+MACRO: refplt_p_vrblcvrg \ref{fig:p_vrblcvrg}
#+MACRO: refplt_p_vrblcvrg_ratio \ref{fig:p_vrblcvrg_ratio}
#+MACRO: refplt_p_vrblcvrg_pca \ref{fig:p_vrblcvrg_pca}
#+MACRO: refplt_p_scree \ref{fig:p_scree}
#+MACRO: refplt_p_pca_loadings \ref{fig:p_pca_loadings}
#+MACRO: refplt_p_pca_scores \ref{fig:p_pca_scores}
#+MACRO: refplt_p_surv \ref{fig:p_surv}
#+MACRO: refplt_p_hazard \ref{fig:p_hazard}
#+MACRO: refplt_p_hazard_time \ref{fig:p_hazard_time}
#+MACRO: refplt_p_agedens \ref{fig:p_agedens}
#+MACRO: refplt_p_yeardens \ref{fig:p_yeardens}
#+MACRO: refplt_p_coxphdiag_more \ref{fig:p_coxphdiag_more}
#+MACRO: refplt_p_pred_popprxcnt \ref{fig:p_pred_popprxcnt}
#+MACRO: refplt_p_pred_proxcntpop \ref{fig:p_pred_proxcntpop}
#+MACRO: refplt_p_condmef \ref{fig:p_condmef}
#+MACRO: refplt_p_pred_heatmap \ref{fig:p_pred_heatmap}
#+MACRO: refplt_p_heatmap_info \ref{fig:p_heatmap_info}
#+MACRO: refplt_p_pred_heatmap_wocryside \ref{fig:p_pred_heatmap_wocryside}
#+MACRO: refplt_p_pred_heatmap_onlycryside \ref{fig:p_pred_heatmap_onlycryside}
#+MACRO: refplt_p_pred_heatmap_alt \ref{fig:p_pred_heatmap_alt}
#+MACRO: refplt_p_surv_death \ref{fig:p_surv_death}
#+MACRO: refplt_p_lngtdvelp \ref{fig:p_lngtdvelp}


# reftbl
#+MACRO: reftbl_t_coxzph \ref{tbl:t_coxzph}
#+MACRO: reftbl_t_sumstats \ref{tbl:t_sumstats}
#+MACRO: reftbl_t_selfid \ref{tbl:t_selfid}
#+MACRO: reftbl_t_reg_coxph_deathcfg \ref{tbl:t_reg_coxph_deathcfg}
#+MACRO: reftbl_t_drop1 \ref{tbl:t_drop1}
#+MACRO: reftbl_t_reg_coxph \ref{tbl:t_reg_coxph}
#+MACRO: reftbl_t_reg_coxph_density \ref{tbl:t_reg_coxph_density}
#+MACRO: reftbl_t_reg_coxph_timeslice \ref{tbl:t_reg_coxph_timeslice}
#+MACRO: reftbl_t_reg_coxph_comp \ref{tbl:t_reg_coxph_comp}
#+MACRO: reftbl_t_reg_coxph_dens \ref{tbl:t_reg_coxph_dens}
#+MACRO: reftbl_t_reg_coxph_env \ref{tbl:t_reg_coxph_env}
#+MACRO: reftbl_t_reg_coxph_af \ref{tbl:t_reg_coxph_af}
#+MACRO: reftbl_t_reg_coxph_timecfg \ref{tbl:t_reg_coxph_timecfg}
#+MACRO: reftbl_t_reg_coxph_dimred \ref{tbl:t_reg_coxph_dimred}
#+MACRO: reftbl_t_reg_coxph_reg \ref{tbl:t_reg_coxph_reg}


# coefs
#+MACRO: coef_genderF -0.038
#+MACRO: coef_gendercouple -0.140
#+MACRO: coef_pmdens_cry 0.648
#+MACRO: coef_pmdens_cry_sq -0.027
#+MACRO: coef_slfidfcnfoundation 0.203
#+MACRO: coef_slfidfcncollection -0.454
#+MACRO: coef_slfidfcnother 1.091
#+MACRO: coef_founder_dead_binary 0.280
#+MACRO: coef_muem_fndr_name 0.048
#+MACRO: coef_an_inclusionincluded 0.193
#+MACRO: coef_an_inclusiondropped 0.460
#+MACRO: coef_proxcnt10 0.263
#+MACRO: coef_popm_circle10 0.268
#+MACRO: coef_recession -1.586
#+MACRO: coef_covid 0.423
#+MACRO: coef_proxcnt10:popm_circle10 -0.089
#+MACRO: pvlu_genderF 0.91
#+MACRO: pvlu_gendercouple 0.66
#+MACRO: pvlu_pmdens_cry 0.058
#+MACRO: pvlu_pmdens_cry_sq 0.22
#+MACRO: pvlu_slfidfcnfoundation 0.62
#+MACRO: pvlu_slfidfcncollection 0.40
#+MACRO: pvlu_slfidfcnother 0.00032
#+MACRO: pvlu_founder_dead_binary 0.52
#+MACRO: pvlu_muem_fndr_name 0.87
#+MACRO: pvlu_an_inclusionincluded 0.57
#+MACRO: pvlu_an_inclusiondropped 0.35
#+MACRO: pvlu_proxcnt10 0.00047
#+MACRO: pvlu_popm_circle10 0.0047
#+MACRO: pvlu_recession 0.12
#+MACRO: pvlu_covid 0.15
#+MACRO: pvlu_proxcnt10:popm_circle10 0.0032
#+MACRO: coef_genderF_exp 0.96
#+MACRO: coef_gendercouple_exp 0.87
#+MACRO: coef_pmdens_cry_exp 1.91
#+MACRO: coef_pmdens_cry_sq_exp 0.97
#+MACRO: coef_slfidfcnfoundation_exp 1.23
#+MACRO: coef_slfidfcncollection_exp 0.63
#+MACRO: coef_slfidfcnother_exp 2.98
#+MACRO: coef_founder_dead_binary_exp 1.32
#+MACRO: coef_muem_fndr_name_exp 1.05
#+MACRO: coef_an_inclusionincluded_exp 1.21
#+MACRO: coef_an_inclusiondropped_exp 1.58
#+MACRO: coef_proxcnt10_exp 1.30
#+MACRO: coef_popm_circle10_exp 1.31
#+MACRO: coef_recession_exp 0.20
#+MACRO: coef_covid_exp 1.53
#+MACRO: coef_proxcnt10:popm_circle10_exp 0.92
#+MACRO: coef_genderF_perc 3.9
#+MACRO: coef_gendercouple_perc 15
#+MACRO: coef_pmdens_cry_perc 91
#+MACRO: coef_pmdens_cry_sq_perc 2.8
#+MACRO: coef_slfidfcnfoundation_perc 23
#+MACRO: coef_slfidfcncollection_perc 58
#+MACRO: coef_slfidfcnother_perc 198
#+MACRO: coef_founder_dead_binary_perc 32
#+MACRO: coef_muem_fndr_name_perc 4.9
#+MACRO: coef_an_inclusionincluded_perc 21
#+MACRO: coef_an_inclusiondropped_perc 58
#+MACRO: coef_proxcnt10_perc 30
#+MACRO: coef_popm_circle10_perc 31
#+MACRO: coef_recession_perc 389
#+MACRO: coef_covid_perc 53
#+MACRO: coef_proxcnt10:popm_circle10_perc 9.3


# coefs2
#+MACRO: popm_circle10_marg0 2.97
#+MACRO: proxcnt10_marg0 3.03
#+MACRO: N_below_popm_circle0_marg0 5056
#+MACRO: perc_below_popm_circle10_marg0 83
#+MACRO: N_below_proxcnt10_marg0 4960
#+MACRO: perc_below_proxcnt10_marg0 81
#+MACRO: N_zoneBL 4508
#+MACRO: N_zoneTL 452
#+MACRO: N_zoneBR 548
#+MACRO: N_zoneTR 588
#+MACRO: N_zonebottom 5056
#+MACRO: N_zonetop 1040
#+MACRO: N_zoneleft 4960
#+MACRO: N_zoneright 1136
#+MACRO: perc_zoneBL 74
#+MACRO: perc_zoneTL 7
#+MACRO: perc_zoneBR 9
#+MACRO: perc_zoneTR 10
#+MACRO: perc_zonebottom 83
#+MACRO: perc_zonetop 17
#+MACRO: perc_zoneleft 81
#+MACRO: perc_zoneright 19
:end:


